Конфигурация/Tasks/ЗадачаИсполнителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Task>
		<Properties>
			<Name>ЗадачаИсполнителя</Name>
			<Addressing>InformationRegister.СоставГруппПользователей</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОбучениеСотрудников</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Плановый срок исполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбучениеПройденоОффлайн</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СканПаспортаПайщикаПроверен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветОВозможностиЗачисленияПаев</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтветаНаЗаявкуПайщикаОЗачисленииПаев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтчетаОВозможностиЗачисленияПаев</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>ГруппаИсполнителей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Конфигурация/Tasks/ЗадачаИсполнителя/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" И Параметры.Свойство("Ключ") Тогда
		Если ТипЗнч(Параметры.Ключ) = Тип("ЗадачаСсылка.ЗадачаИсполнителя") И ЗначениеЗаполнено(Параметры.Ключ.БизнесПроцесс) Тогда
			
			ЗадачаСсылка = Параметры.Ключ;
			
			ТипБизнесПроцесса	= ЗадачаСсылка.БизнесПроцесс.Метаданные();
			ВыбраннаяФорма		= БизнесПроцессы[ТипБизнесПроцесса.Имя].ФормаВыполненияЗадачи(ЗадачаСсылка, ЗадачаСсылка.ТочкаМаршрута);
			СтандартнаяОбработка = Ложь;

		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры
	
Функция ПолучитьЭлектронныеАдресаИсполнителейЗадачи(Задача, Отказ) Экспорт
	
	Запрос = Новый Запрос;
	
	Если ЗначениеЗаполнено(Задача.Исполнитель) Тогда
		Запрос.УстановитьПараметр("Исполнитель", Задача.Исполнитель);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Пользователи.Ссылка КАК Пользователь,
			|	Пользователи.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
			|ИЗ
			|	Справочник.Пользователи КАК Пользователи
			|ГДЕ
			|	Пользователи.Ссылка = &Исполнитель";
		
	Иначе
		Запрос.УстановитьПараметр("ГруппаИсполнителей", Задача.ГруппаИсполнителей);
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
			|	СоставГруппПользователей.Пользователь.Ссылка КАК Пользователь,
			|	СоставГруппПользователей.Пользователь.АдресЭлектроннойПочты КАК АдресЭлектроннойПочты
			|ИЗ
			|	РегистрСведений.СоставГруппПользователей КАК СоставГруппПользователей
			|ГДЕ
			|	(СоставГруппПользователей.ГруппаПользователей = &ГруппаИсполнителей
			|			ИЛИ СоставГруппПользователей.ГруппаПользователей.Родитель = &ГруппаИсполнителей)";
		
	КонецЕсли;
	
	ЭлектронныеАдресаИсполнителейЗадачи = Новый Массив;
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Для задачи %1 не определён ни один исполнитель", Задача.Ссылка),,,, Отказ);
		
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ПустаяСтрока(Выборка.АдресЭлектроннойПочты) Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("У пользователя %1 не указан адрес электронной почты", Выборка.Пользователь),,,, Отказ);
				
			Иначе
				ЭлектронныеАдресаИсполнителейЗадачи.Добавить(Выборка.АдресЭлектроннойПочты);
				
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	Возврат СтрСоединить(ЭлектронныеАдресаИсполнителейЗадачи, "; ");
	
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Данные.Выполнена Тогда
		Представление = СтрШаблон("%1 %2 от %3 (Выполнена %4)", Данные.Наименование, Данные.Номер, Данные.Дата, Данные.ДатаВыполнения);
	Иначе
		Представление = СтрШаблон("%1 %2 от %3", Данные.Наименование, Данные.Номер, Данные.Дата);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Выполнена");
	Поля.Добавить("Наименование");
	Поля.Добавить("Номер");
	Поля.Добавить("Дата");
	Поля.Добавить("ДатаВыполнения");
	
КонецПроцедуры
